###################################################################

# Created by write_sdc on Tue Apr 20 13:10:09 2021

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_driving_cell -min -lib_cell BUFFD2BWP30P140LVT [get_ports clk]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports rst]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports i_valid]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[31]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[30]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[29]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[28]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[27]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[26]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[25]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[24]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[23]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[22]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[21]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[20]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[19]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[18]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[17]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[16]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[15]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[14]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[13]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[12]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[11]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[10]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[9]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[8]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[7]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[6]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[5]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[4]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[3]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[2]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[1]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_data_bus[0]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports i_en]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_cmd[1]}]
set_driving_cell -lib_cell BUFFD2BWP30P140LVT [get_ports {i_cmd[0]}]
set_load -pin_load 0.1 [get_ports {o_valid[3]}]
set_load -pin_load 0.1 [get_ports {o_valid[2]}]
set_load -pin_load 0.1 [get_ports {o_valid[1]}]
set_load -pin_load 0.1 [get_ports {o_valid[0]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[127]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[126]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[125]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[124]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[123]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[122]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[121]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[120]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[119]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[118]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[117]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[116]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[115]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[114]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[113]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[112]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[111]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[110]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[109]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[108]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[107]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[106]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[105]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[104]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[103]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[102]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[101]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[100]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[99]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[98]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[97]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[96]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[95]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[94]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[93]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[92]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[91]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[90]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[89]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[88]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[87]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[86]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[85]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[84]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[83]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[82]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[81]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[80]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[79]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[78]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[77]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[76]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[75]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[74]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[73]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[72]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[71]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[70]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[69]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[68]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[67]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[66]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[65]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[64]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[63]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[62]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[61]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[60]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[59]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[58]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[57]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[56]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[55]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[54]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[53]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[52]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[51]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[50]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[49]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[48]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[47]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[46]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[45]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[44]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[43]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[42]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[41]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[40]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[39]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[38]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[37]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[36]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[35]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[34]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[33]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[32]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[31]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[30]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[29]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[28]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[27]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[26]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[25]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[24]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[23]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[22]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[21]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[20]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[19]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[18]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[17]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[16]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[15]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[14]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[13]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[12]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[11]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[10]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[9]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[8]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[7]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[6]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[5]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[4]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[3]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[2]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[1]}]
set_load -pin_load 0.1 [get_ports {o_data_bus[0]}]
create_clock [get_ports clk]  -name clk  -period 0.3  -waveform {0 0.15}  -add
set_clock_uncertainty -setup 0.15  [get_clocks clk]
set_false_path   -from [list [get_ports rst] [get_ports i_en]]
set_input_delay -clock clk  0.06  [get_ports rst]
set_input_delay -clock clk  0.06  [get_ports i_en]
set_input_delay -clock clk  0.06  [get_ports i_valid]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[31]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[30]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[29]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[28]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[27]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[26]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[25]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[24]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[23]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[22]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[21]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[20]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[19]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[18]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[17]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[16]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[15]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[14]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[13]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[12]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[11]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[10]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[9]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[8]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[7]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[6]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[5]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[4]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[3]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[2]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[1]}]
set_input_delay -clock clk  0.06  [get_ports {i_data_bus[0]}]
set_input_delay -clock clk  0.06  [get_ports {i_cmd[1]}]
set_input_delay -clock clk  0.06  [get_ports {i_cmd[0]}]
set_output_delay -clock clk  0.06  [get_ports {o_valid[3]}]
set_output_delay -clock clk  0.06  [get_ports {o_valid[2]}]
set_output_delay -clock clk  0.06  [get_ports {o_valid[1]}]
set_output_delay -clock clk  0.06  [get_ports {o_valid[0]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[127]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[126]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[125]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[124]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[123]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[122]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[121]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[120]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[119]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[118]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[117]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[116]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[115]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[114]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[113]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[112]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[111]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[110]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[109]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[108]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[107]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[106]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[105]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[104]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[103]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[102]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[101]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[100]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[99]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[98]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[97]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[96]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[95]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[94]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[93]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[92]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[91]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[90]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[89]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[88]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[87]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[86]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[85]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[84]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[83]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[82]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[81]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[80]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[79]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[78]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[77]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[76]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[75]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[74]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[73]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[72]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[71]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[70]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[69]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[68]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[67]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[66]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[65]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[64]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[63]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[62]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[61]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[60]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[59]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[58]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[57]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[56]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[55]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[54]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[53]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[52]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[51]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[50]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[49]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[48]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[47]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[46]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[45]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[44]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[43]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[42]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[41]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[40]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[39]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[38]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[37]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[36]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[35]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[34]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[33]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[32]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[31]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[30]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[29]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[28]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[27]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[26]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[25]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[24]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[23]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[22]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[21]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[20]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[19]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[18]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[17]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[16]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[15]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[14]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[13]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[12]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[11]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[10]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[9]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[8]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[7]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[6]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[5]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[4]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[3]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[2]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[1]}]
set_output_delay -clock clk  0.06  [get_ports {o_data_bus[0]}]
